#+TAGS: { FAILS(f) PARTLY(p) WORKS(w) }

*Note:* a complete list of these features including keyboard
  shortcuts, links, and descriptions is available on
  https://github.com/novoid/github-orgmode-tests

This page demonstrates Org-mode features that are (or are not)
supported by github which is using an (old) version of [[https://github.com/wallyqs/org-ruby][org-ruby]].

| *Feature*                           | *failed*         | *worked*         |
|-------------------------------------+------------------+------------------|
| simple text formatting              |                  | <2013-02-26 Tue> |
| comment lines                       |                  | <2017-09-17 Sun> |
| multi line comment block            |                  | <2017-09-17 Sun> |
| simple lists                        |                  | <2013-02-26 Tue> |
| lists with checkboxes               | <2018-06-14 Thu> |                  |
| nested lists                        |                  | <2013-10-17 Thu> |
| Headings with TODO items            | <2018-06-14 Thu> |                  |
| hide Drawers                        |                  | <2013-10-17 Thu> |
| simple blocks                       |                  | <2013-02-26 Tue> |
| simple links                        |                  | <2013-02-26 Tue> |
| footnotes                           | <2018-06-14 Thu> |                  |
| custom links                        | <2018-06-14 Thu> |                  |
| link to ID                          | <2018-06-14 Thu> |                  |
| states                              | <2018-06-14 Thu> |                  |
| chain siblings                      | <2018-06-14 Thu> |                  |
| priorities                          |                  | <2013-02-26 Tue> |
| subtask statistics                  |                  | <2013-02-26 Tue> |
| tags                                | <2018-06-14 Thu> |                  |
| simple tables                       |                  | <2013-02-26 Tue> |
| tables formatting: bold             |                  | <2013-10-17 Thu> |
| tables formatting: align numbers    | <2018-06-14 Thu> |                  |
| hiding TBLFM                        |                  | <2013-02-26 Tue> |
| column view                         | <2018-06-14 Thu> |                  |
| showing timestamps                  |                  | <2013-02-26 Tue> |
| showing clocking summaries          |                  | <2013-02-26 Tue> |
| showing clocking drawers            | <2018-06-14 Thu> |                  |
| simple SRC blocks                   |                  | <2013-02-26 Tue> |
| SRC block formatting as verbatim    | <2018-06-14 Thu> |                  |
| SRC blocks with syntax highlighting |                  | <2014-04-13 Sun> |
| LaTeX \alpha \beta \phi             |                  | <2013-10-17 Thu> |
| LaTeX simple formulas               | <2018-06-14 Thu> |                  |
| LaTeX blocks                        | <2018-06-14 Thu> |                  |


* Featuretest
** Text formatting                                                  :PARTLY:

- *bold*
- /italic/
- _underline_
- +strike through+
- =code=
- ~commands~
- http://orgmode.org

: small example

#+COMMENT: this will never be exported

#+BEGIN_COMMENT
multi
line
comment
#+END_COMMENT


** Lists                                                            :PARTLY:

simple list:
- Emacs
- Org-mode
- Lists

enumerate:
1. Emacs
2. Org-mode
3. Lists

- Clean out garage
  1. [ ] get stuff out
     - [ ] be careful with that axe, Eugene
  2. [ ] get rid of old stuff
     - using eBay?
     - try to use rubbish as birthday presents for family
  3. [ ] repaint garage
  4. [ ] put stuff back in

** Headings with TODO items                                          :FAILS:

*** TODO Clean out garage [0/4]

**** TODO get stuff out

- be careful with that axe, Eugene

**** TODO get rid of old stuff

- using eBay?
- try to use rubbish as birthday presents for family

**** TODO repaint garage

**** TODO put stuff back in

** Drawers                                                           :FAILS:

*** NEXT Test with category property                                :mytag:
:PROPERTIES:
:CATEGORY: mycategory
:END:

** simple blocks ([[http://orgmode.org/org.html#Blocks][docu]])                                              :WORKS:

#+BEGIN_EXAMPLE
Some example from a text file.
#+END_EXAMPLE

- more of it in the Babel section later on

** comments ([[http://orgmode.org/manual/Comment-lines.html#Comment-lines][docu]])                                                                           :WORKS:

Comment lines:

space hash space:

 # This is a comment

space space hash space:

  # This is a comment

-----------

Comment block:

#+BEGIN_COMMENT
This is a multi line comment block.
This is the second line.

This is the second paragraph.
#+END_COMMENT

** Noexport tag of heading                                                          :FAILS:noexport:

This heading is tagged with =noexport= and therefore should not be
exported. Whatever this means for GitHub. ;-)

** links [[http://orgmode.org/org.html#Hyperlinks][(docu)]]                                                     :PARTLY:

todo: target
: # <<link>>

- id:myexampleid
- [[file:~/.zshrc.local]]
- http://orgmode.org
  - [[http://orgmode.org/org.html#External-links][docu: list of external links]]
- custom links: [[contact:John%20Smith][contact:John Smith]]
  - [[http://orgmode.org/org.html#Link-abbreviations][docu: link abbrevations]]

- footnotes ([[http://orgmode.org/org.html#Footnotes][docu]])
  - plain          [fn::great content here]
  - with own label [fn:mylabel:great content here]
  - reference      [fn:myotherlabel] [fn:2]

[fn:myotherlabel] This is a footnote from reference above.
[fn:2] This is a footnote with a simple number as label.

*** heading with PROPERTIES drawer containing ID
:PROPERTIES:
:ID: myexampleid
:END:

foo bar

** states; TODO items ([[http://orgmode.org/org.html#TODO-Items][docu]])                                        :PARTLY:

*** making dependencies explicit

**** example with chain siblings

***** NEXT buy bike
:PROPERTIES:
:TRIGGER: chain-siblings(NEXT)
:END:

***** take tour

***** goto hospital

*** priorities ([[http://orgmode.org/org.html#Priorities][docu]])

**** TODO [#A] example
**** NEXT [#B] example

*** breaking down in subtasks ([[http://orgmode.org/org.html#Breaking-down-tasks][docu]])

**** TODO example [1/3] [33%]
***** DONE subtask 1
***** TODO subtask 2
***** TODO subtask 3
** tags [[http://orgmode.org/org.html#Tags][(docu)]]                                                       :FAILS:

*** example                                                           :tag:

** tables simple [[http://orgmode.org/org.html#Tables][(docu)]]                                             :PARTLY:

| *Heading1* | *head2* |
|------------+---------|
| entry      |      42 |
| foo        |    21.7 |
|------------+---------|
| end        |   99.99 |

** tables complex ([[http://orgmode.org/org.html#The-spreadsheet][docu]], [[http://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html][tutorial]])                                  :PARTLY:

#+TBLNAME: mydemo-USD-EUR-rate
| *US-Dollar* |      *EUR* |
|           1 | 0.76481836 |

|     *When* | *What*                 | *USD* | *EUR* |
|------------+------------------------+-------+-------|
| 2012-02-03 | Taxi Graz-Airport      |       | 18.00 |
| 2012-02-03 | Taxi Seattle Airport   | 25.00 | 19.12 |
| 2012-02-13 | Taxi                   |  7.00 |  5.35 |
| 2012-02-14 | Taxi                   |  8.00 |  6.12 |
| 2012-02-17 | Taxi to Airport SeaTac | 35.00 | 26.77 |
| 2012-02-22 | Taxi Airport-Graz      |       | 16.00 |
|------------+------------------------+-------+-------|
|            |                        |       | 91.36 |
#+TBLFM: @>$4=vsum(@I$4..@II$4);%.2f::@3$4=@3$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@4$4=@4$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@5$4=@5$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f::@6$4=@6$3*remote(mydemo-USD-EUR-rate,@2$2);%.2f

** column view ([[http://orgmode.org/org.html#Column-view][docu]])                                                :FAILS:
:PROPERTIES:
:COLUMNS:  %25ITEM %TAGS %PRIORITY %TODO %10MyProperties
:MyProperties_ALL: "Thomas" "Maria" "Susan" "Joe"
:END:

*** example sub-item                                               :mytag1:
:PROPERTIES:
:MyProperties: Susan
:END:

*** NEXT [#B] another example                                      :mytag2:
:PROPERTIES:
:MyProperties: Thomas
:END:

** dates & time ([[http://orgmode.org/org.html#Dates-and-Times][docu]])                                               :WORKS:

- ~C-c .~    *insert active* <2012-04-23 Mon>  (with ~C-u~: <2012-04-23 Mon 19:14>)
- ~C-c !~    insert inactive [2012-04-23 Mon]  (with ~C-u~: [2012-04-23 Mon 19:14])

** clocking time ([[http://orgmode.org/org.html#Clocking-work-time][docu]])                                             :PARTLY:

*** example sub-hierarchy with report

#+BEGIN: clocktable :maxlevel 2 :scope subtree
Clock summary at [2012-11-19 Mon 11:17]

| Headline     | Time    |
|--------------+---------|
| *Total time* | *27:16* |
|--------------+---------|
#+END:

**** example item
:LOGBOOK:
CLOCK: [2012-11-19 Mon 11:16]--[2012-11-19 Mon 11:17] =>  0:01
CLOCK: [2012-11-18 Sun 19:15]--[2012-11-18 Sun 19:23] =>  0:08
:END:

**** another item
:LOGBOOK:
CLOCK: [2012-11-18 Sun 19:26]--[2012-11-18 Sun 19:33] =>  0:07
CLOCK: [2012-11-17 Sat 16:25]--[2012-11-18 Sun 19:25] => 27:00
:END:

** source code ([[http://orgmode.org/org.html#Working-With-Source-Code][docu]])                                               :PARTLY:

#+BEGIN_SRC python
  def foo(argument):
       print "Hello World"
 #+END_SRC

** babel ([[http://orgmode.org/org.html#Library-of-Babel][docu]])                                                      :FAILS:

*** babel simple ([[http://orgmode.org/org.html#Working-With-Source-Code][doc]])

- some examples are taken from [[http://orgmode.org/worg/org-contrib/babel/intro.html][Worg: Introduction to Babel]]

**** shell

#+BEGIN_SRC sh
pwd
#+END_SRC

**** ruby

#+begin_src ruby
require 'date'
"This file was last evaluated on #{Date.today}"
#+end_src

**** python

#+BEGIN_SRC python
return 42 + 7
#+END_SRC

**** ditaa

#+begin_src ditaa :file blue.png :cmdline -r
  +---------+
  | cBLU    |
  |         |
  |    +----+
  |    |cPNK|
  |    |    |
  +----+----+
#+end_src

*** babel advanced

**** session with shell and R

#+name: directories
#+begin_src sh :results replace
  cd ~/archive/events_memories && du -sc * |grep -v total
#+end_src

Using result set "directories" from above as "dirs" in R below:

#+name: directory-pie-chart(dirs = directories)
#+begin_src R :session R-pie-example :file ./dirs.png
  pie(dirs[,1], labels = dirs[,2])
#+end_src

** LaTeX ([[http://orgmode.org/org.html#Embedded-LaTeX][docu]])                                                      :FAILS:

Greek characters \alpha \beta \phi \LaTeX{}  $\varphi$

#+BEGIN_LaTeX

  \section{Section Title}

  This is \emph{emphasized} and $y=x^2$ is an equation.

#+END_LaTeX


* Testing
** Headings

** heading with properties
:PROPERTIES:
:CREATED: <2011-10-09 Sun 15:16>
:END:

** tables

| *head1*               | *head2* | *head3* |
|-----------------------+---------+---------|
| text                  |      42 | -----   |
| me@server.example.com |      23 | :-)     |
|-----------------------+---------+---------|
|                       |      65 |         |
#+TBLFM: @>$2 = vsum(@I$2..@II$2)

** links

- direct URL: http://tagstore.org
[[http://tagstore.org][- indirect URL]]
- direct email: me@example.com
- [[me@server.com][indirect email]]

** examples

verse:
#+begin_verse
This is an example.
    Second line.
Very long line with many characters showing the wordwrap feature or the not existing word wrap feature
#+end_verse

quote:
#+begin_quote
This is an example.
    Second line.
Very long line with many characters showing the wordwrap feature or the not existing word wrap feature
#+end_quote

only colon:
: This is an example.
:     Second line.
: Very long line with many characters showing the wordwrap feature or the not existing word wrap feature

non-specific source:
#+begin_src
This is an example.
    Second line.
Very long line with many characters showing the wordwrap feature or the not existing word wrap feature
#+end_src

python source:
#+begin_src python
if VALUE and dummy < 42:
    execute_something("Dummy text", 23)
#+end_src



** Underscores_like_this

- me_low
- 2_8
- ~*.org_archive~
- ~*.org\_archive~
- *.org\_archive

** Orgmode examples

Das hier ist eine Erklärung von dem Ganzen:

:conf: ;; this is ELISP code
:conf: (foo (bar))

Und in der Org-mode-Datei wird das dann so angewendet:

:org: :PROPERTIES:
:org: :ID: this-is-an-example
:org: :END:
